fill_guo_problems = [
    # 题目 1
    {
        "grid_constraints": {
            "rows": [["欧洲国家"], ["有世袭君主(独裁者不算)"], ["发达国家"]],
            "cols": [["UN安理会常任理事国"], ["位于半岛上"], ["岛国"]]
        },
        "cell_options": {
            "0,0": ["英国", "法国"],
            "0,1": ["英国"],
            "0,2": ["英国", "法国", "美国"],
            "1,0": ["西班牙", "葡萄牙", "安道尔", "意大利", "梵蒂冈", "圣马力诺", "丹麦", "挪威", "瑞典", "罗马尼亚", "希腊", "保加利亚", "斯洛文尼亚", "黑山", "克罗地亚", "波斯尼亚和黑塞哥维那", "塞尔维亚", "阿尔巴尼亚", "北马其顿"],
            "1,1": ["沙特阿拉伯","西班牙","安道尔","巴林","卡塔尔","阿曼","丹麦","圣马力诺","挪威","瑞典","阿联酋","科威特","柬埔寨","泰国"],
            "1,2": ["韩国","瑞典","挪威","丹麦","意大利","斯洛文尼亚","安道尔","圣马力诺","梵蒂冈"],
            "2,0": ["爱尔兰","马耳他","塞浦路斯","英国","冰岛"],
            "2,1": ["英国","文莱","日本","汤加"],
            "2,2": ["日本","英国","新加坡","巴哈马","马耳他","新西兰","冰岛","爱尔兰","塞浦路斯"]
        }
    },
    # 题目 2
    {
        "grid_constraints": {
            "rows": [["位于半岛上"], ["美洲国家"], ["国境跨越超过30°纬度"]],
            "cols": [["国旗上有且仅有三色"], ["国旗上有星星"], ["领导人被政变（革命也算）推翻过"]]
        },
        "cell_options": {
            "0,0": ["也门","老挝","泰国","柬埔寨","意大利","波斯尼亚和黑塞哥维那","保加利亚","罗马尼亚","挪威","朝鲜"],
            "0,1": ["美国","智利","哥伦比亚","阿根廷","巴拿马","乌拉圭","巴拉圭"],
            "0,2": ["俄罗斯","美国","智利","阿根廷","英国","挪威","法国"],
            "1,0": ["新加坡","马来西亚","斯洛文尼亚","越南","索马里","朝鲜"],
            "1,1": ["洪都拉斯","苏里南","智利","巴西","巴拿马","巴拉圭","委内瑞拉","古巴"],
            "1,2": ["美国","智利","中国","巴西"],
            "2,0": ["韩国","越南","柬埔寨","泰国","意大利","越南","西班牙","葡萄牙","保加利亚","罗马尼亚"],
            "2,1": ["巴西","阿根廷","墨西哥","智利","哥伦比亚","秘鲁","玻利维亚","巴拉圭","乌拉圭"],
            "2,2": ["巴西","智利","英国","法国","阿根廷","俄罗斯"]
        }
    },
    # 题目 3
    {
        "grid_constraints": {
            "rows": [["国旗上有冷","热武器"], ["国旗上有动物"], ["北回归线经过领土或领海"]],
            "cols": [["岛国"], ["全国海拔均低于2000米"], ["曾经为英国殖民地"]]
        },
        "cell_options": {
            "0,0": ["海地","多米尼加"],
            "0,1": ["马耳他","斯里兰卡","多米尼克"],
            "0,2": ["巴哈马"],
            "1,0": ["巴巴多斯","伯利兹"],
            "1,1": ["马耳他","摩尔多瓦","克罗地亚"],
            "1,2": ["孟加拉国","毛里塔尼亚","马里","巴哈马"],
            "2,0": ["肯尼亚","斯威士兰","莫桑比克","阿曼"],
            "2,1": ["埃及","斯里兰卡","马耳他","乌干达","赞比亚","津巴布韦"],
            "2,2": ["埃及","孟加拉国","印度","巴哈马","缅甸"] 
        }
    }
]